octal-ip/ESP8266_JBD_BMS_Monitor/src/main.cpp
#define UDP_MODE
//#define HTTP_MODE
#define TFT_ENABLE

#include <Arduino.h>
#include <SoftwareSerial.h>
#include <ArduinoOTA.h>
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <WiFiUdp.h>
#include <RunningAverage.h>
#include <TelnetPrint.h>

#ifdef TFT_ENABLE
  /* If the TFT is to be enabled:
  - Uncomment the following line in .pio\libdeps\nodemcuv2\TFT_eSPI\User_Setup_Select.h
      #include <User_Setups/Setup1_ILI9341.h>
  - And ensure the following configuration is placed in .pio\libdeps\nodemcuv2\TFT_eSPI\User_Setups\Setup1_ILI9341.h
      #define ILI9341_DRIVER
      #define TFT_CS   PIN_D8  // Chip select control pin D8
      #define TFT_DC   PIN_D3  // Data Command control pin
      #define TFT_RST  -1    // Set TFT_RST to -1 if the display RESET is connected to NodeMCU RST or 3.3V
      #define SPI_FREQUENCY  40000000
      #define SPI_READ_FREQUENCY  20000000
  */
  #define BLUE2RED 3
  #define GREEN2RED 4
  #define RED2GREEN 5
  #define BUFF_SIZE 64
  #define TFT_GREY 0x2104 // Dark grey 16 bit colour
  #include <SPI.h>
  #include <TFT_eSPI.h>
  TFT_eSPI tft = TFT_eSPI();
#endif

#ifdef HTTP_MODE
  #include <ESP8266HTTPClient.h>
#endif

#include <secrets.h> //Edit this file to include the following details:
/*
#define SECRET_SSID "<ssid>>"
#define SECRET_PASS "<password>"
#define SECRET_INFLUXDB "http://<IP Address>:8086/write?db=<db name>&u=<user name>&p=<password>"
#define SECRET_INFLUX_IP_OCTET1 <first IP octet>
#define SECRET_INFLUX_IP_OCTET2 <second IP octet>
#define SECRET_INFLUX_IP_OCTET3 <third IP octet>
#define SECRET_INFLUX_IP_OCTET4 <last IP octet>
*/

#define JBD_RX D2
#define JBD_TX D1
#define BALANCER D0

SoftwareSerial JBDSoftSerial;

byte failures = 0; //Automatically restart the ESP if too many failures occurr in a row.
byte packetStatus = 0;
byte packetCount = 0;
byte incomingByte = 0;
byte avSamples = 240;
byte systemCycles = 0;
byte battCycles = 0;
char post[70];
char StatString[8];
unsigned long lastUnlock = 0;
unsigned long lastRequest = 0;
unsigned long connectTime = 0;
byte statSwitch = 0;

float voltage = 0.0;
float current = 0.0;
float capacityRem = 0.0;
float capacityTyp = 0.0;
float cycles = 0.0;
byte protectionStatus = 0;
byte percentRem = 0;
byte NTCs = 0;
byte cells = 16; //Default to 16 cells. This will be automatically updated.
byte cellCount = 0;
float lowestCell = 0.0;
float highestCell = 0.0;
float cellVoltageDelta = 0.0;
float temps[4] = {0.0, 0.0, 0.0, 0.0};
bool balancerOn = 0;

#ifdef TFT_ENABLE
  //Record the last updates to the TFT screen to avoid updating the screen when no change has occurred. This improves speed and reduces flickering.
  float lastCurrent = 0.0, lastVoltage = 0.0, lastHighestCell = 0.0, lastLowestCell = 0.0, lastCellVoltageDelta = 0.0, lastTemp1 = 0.0, lastTemp2 = 0.0, lastPercentRem = 0.0;
  int dischargeOverCurrent = 0, chargeOverCurrent = 0, cellUnderTemperature = 0, cellOverTemperature = 0, cellModuleUnderVolt = 0, cellModuleOverVolt = 0;
#endif

RunningAverage currentAv(avSamples); //Average out the current readings as these can change rapidly between samples sent to InfluxDB. The other metrics change slowly, if at all.

char packetbuff[100] = {0x0};

#ifdef UDP_MODE
  WiFiUDP udp;
  IPAddress influxhost = {SECRET_INFLUX_IP_OCTET1, SECRET_INFLUX_IP_OCTET2, SECRET_INFLUX_IP_OCTET3, SECRET_INFLUX_IP_OCTET4}; // the IP address of the InfluxDB host
  int influxport = 8092; // the port that the InfluxDB UDP plugin is listening on
#endif

struct BMSCommands{
   const char *name;
   byte request[7];
   unsigned long LastRequest;
   unsigned long RequestFrequency;
   long value;
};

const int BMSRequestsNum = 13;

BMSCommands BMSRequests[BMSRequestsNum] = {
  //Request name, address, LastRequest, RequestFrequency, value)
  {"System_status", {0xdd, 0xa5, 0x03, 0x00, 0xff, 0xfd, 0x77}, 0, 500, 0},
  {"Battery_status", {0xdd, 0xa5, 0x04, 0x00, 0xff, 0xfc, 0x77}, 0, 2000, 0},
  {"Charge_over_temp_release", {0xdd, 0xa5, 0x19, 0x00, 0xff, 0xe7, 0x77}, 0, 60000, 0},
  {"Charge_under_temp_release", {0xdd, 0xa5, 0x1b, 0x00, 0xff, 0xe5, 0x77}, 0, 60000, 0},
  {"Discharge_over_temp_release", {0xdd, 0xa5, 0x1d, 0x00, 0xff, 0xe3, 0x77}, 0, 60000, 0},
  {"Discharge_under_temp_release", {0xdd, 0xa5, 0x1f, 0x00, 0xff, 0xe1, 0x77}, 0, 60000, 0},
  {"Batt_over_volt_trig", {0xdd, 0xa5, 0x20, 0x00, 0xff, 0xe0, 0x77}, 0, 60000, 0},
  {"Batt_over_volt_release", {0xdd, 0xa5, 0x21, 0x00, 0xff, 0xdf, 0x77}, 0, 60000, 0},
  {"Batt_under_volt_release", {0xdd, 0xa5, 0x23, 0x00, 0xff, 0xdd, 0x77}, 0, 60000, 0},
  {"Cell_over_volt_release", {0xdd, 0xa5, 0x25, 0x00, 0xff, 0xdb, 0x77}, 0, 60000, 0},
  {"Cell_under_volt_release", {0xdd, 0xa5, 0x27, 0x00, 0xff, 0xd9, 0x77}, 0, 60000, 0},
  {"Charge_over_current_trig", {0xdd, 0xa5, 0x28, 0x00, 0xff, 0xd8, 0x77}, 0, 60000, 0},
  {"Discharge_over_current_release", {0xdd, 0xa5, 0x29, 0x00, 0xff, 0xd7, 0x77}, 0, 60000, 0}
};

void setup() {
  Serial.begin(115200);

  JBDSoftSerial.begin(9600, SWSERIAL_8N1, JBD_RX, JBD_TX, false, 50, 500);
  JBDSoftSerial.enableRx(true);

  Serial.println();
  Serial.print("Connecting to "); Serial.println(SECRET_SSID);

  WiFi.mode(WIFI_STA);
  WiFi.begin(SECRET_SSID, SECRET_PASS);

  #ifdef TFT_ENABLE
    tft.begin();
    tft.setRotation(3);
    tft.fillScreen(TFT_BLACK);
    tft.setTextSize(1);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.drawString("Status:", 2, 170, 2);
    tft.drawString("Highest Cell:", 2, 185, 2);
    tft.drawString("Lowest Cell:", 2, 200, 2);
    tft.drawString("Voltage Delta:", 2, 215, 2);
    tft.drawString("Power:", 180, 170, 2);
    tft.drawString("Temp1:", 180, 185, 2);
    tft.drawString("Temp2:", 180, 200, 2);
    tft.drawString("SOC:", 180, 215, 2);
    tft.drawFastHLine(0, 160, 319, TFT_WHITE);
  #endif

  connectTime = millis();
  Serial.print("Waiting for WiFi to connect");

  while (!WiFi.isConnected() && (unsigned long)(millis() - connectTime) < 5000) { //Wait for the wifi to connect for up to 5 seconds.
    delay(100);
    Serial.print(".");
  }

  if (!WiFi.isConnected()) {
    Serial.println();
    Serial.println("WiFi didn't connect, restarting...");
    ESP.restart(); //Restart if the WiFi still hasn't connected.
  }
  else {
    Serial.println();
    Serial.print("IP address: "); Serial.println(WiFi.localIP());
  }

  // Port defaults to 8266
  ArduinoOTA.setPort(8266);

  // Hostname defaults to esp8266-[MAC]
  ArduinoOTA.setHostname("esp8266-JBD-BMS-monitor");

  // No authentication by default
  // ArduinoOTA.setPassword("admin");

  // Password can be set with it's md5 value as well
  // MD5(admin) = 21232f297a57a5a743894a0e4a801fc3
  // ArduinoOTA.setPasswordHash("21232f297a57a5a743894a0e4a801fc3");

  ArduinoOTA.onStart([]() {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH) {
      type = "sketch";
    } else { // U_SPIFFS
      type = "filesystem";
    }

