octal-ip/ESP8266_JBD_BMS_Monitor/src/main.cpp
    // NOTE: if updating SPIFFS this would be the place to unmount SPIFFS using SPIFFS.end()
    Serial.println("Start updating " + type);
  });
  ArduinoOTA.onEnd([]() {
    Serial.println("\nEnd");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    Serial.printf("Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) {
      Serial.println("Auth Failed");
    } else if (error == OTA_BEGIN_ERROR) {
      Serial.println("Begin Failed");
    } else if (error == OTA_CONNECT_ERROR) {
      Serial.println("Connect Failed");
    } else if (error == OTA_RECEIVE_ERROR) {
      Serial.println("Receive Failed");
    } else if (error == OTA_END_ERROR) {
      Serial.println("End Failed");
    }
  });
  ArduinoOTA.begin();
  // ****End ESP8266 OTA and Wifi Configuration****

  //Telnet log is accessible at port 23
  TelnetPrint.begin();

  pinMode(BALANCER, OUTPUT);
}

#ifdef TFT_ENABLE
  unsigned int rainbow(byte value)
  {
    // Value is expected to be in range 0-127
    // The value is converted to a spectrum colour from 0 = blue through to 127 = red

    byte red = 0; // Red is the top 5 bits of a 16 bit colour value
    byte green = 0;// Green is the middle 6 bits
    byte blue = 0; // Blue is the bottom 5 bits

    byte quadrant = value / 32;

    if (quadrant == 0) {
      blue = 31;
      green = 2 * (value % 32);
      red = 0;
    }
    if (quadrant == 1) {
      blue = 31 - (value % 32);
      green = 63;
      red = 0;
    }
    if (quadrant == 2) {
      blue = 0;
      green = 63;
      red = value % 32;
    }
    if (quadrant == 3) {
      blue = 0;
      green = 63 - 2 * (value % 32);
      red = 31;
    }
    return (red << 11) + (green << 5) + blue;
  }

  float mapf(float x, float in_min, float in_max, float out_min, float out_max)
  {
    return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
  }

  int ringMeter(float value, int vmin, int vmax, int x, int y, int r, const char *units, byte scheme)
  {
    // Minimum value of r is about 52 before value text intrudes on ring
    // drawing the text first is an option
    
    x += r; y += r;   // Calculate coords of centre of ring

    int w = r / 3;    // Width of outer ring is 1/4 of radius
    
    int angle = 150;  // Half the sweep angle of meter (300 degrees)

    int v = mapf(value, vmin, vmax, -angle, angle); // Map the value to an angle v

    byte seg = 3; // Segments are 3 degrees wide = 100 segments for 300 degrees
    byte inc = 6; // Draw segments every 3 degrees, increase to 6 for segmented ring

    // Variable to save "value" text colour from scheme and set default
    int colour = TFT_BLUE;
  
    // Draw colour blocks every inc degrees
    for (int i = -angle+inc/2; i < angle-inc/2; i += inc) {
      // Calculate pair of coordinates for segment start
      float sx = cos((i - 90) * 0.0174532925);
      float sy = sin((i - 90) * 0.0174532925);
      uint16_t x0 = sx * (r - w) + x;
      uint16_t y0 = sy * (r - w) + y;
      uint16_t x1 = sx * r + x;
      uint16_t y1 = sy * r + y;

      // Calculate pair of coordinates for segment end
      float sx2 = cos((i + seg - 90) * 0.0174532925);
      float sy2 = sin((i + seg - 90) * 0.0174532925);
      int x2 = sx2 * (r - w) + x;
      int y2 = sy2 * (r - w) + y;
      int x3 = sx2 * r + x;
      int y3 = sy2 * r + y;

      if (i < v) { // Fill in coloured segments with 2 triangles
        switch (scheme) {
          case 0: colour = TFT_RED; break; // Fixed colour
          case 1: colour = TFT_GREEN; break; // Fixed colour
          case 2: colour = TFT_BLUE; break; // Fixed colour
          case 3: colour = rainbow(map(i, -angle, angle, 0, 127)); break; // Full spectrum blue to red
          case 4: colour = rainbow(map(i, -angle, angle, 70, 127)); break; // Green to red (high temperature etc)
          case 5: colour = rainbow(map(i, -angle, angle, 127, 63)); break; // Red to green (low battery etc)
          default: colour = TFT_BLUE; break; // Fixed colour
        }
        tft.fillTriangle(x0, y0, x1, y1, x2, y2, colour);
        tft.fillTriangle(x1, y1, x2, y2, x3, y3, colour);
        //text_colour = colour; // Save the last colour drawn
      }
      else // Fill in blank segments
      {
        tft.fillTriangle(x0, y0, x1, y1, x2, y2, TFT_GREY);
        tft.fillTriangle(x1, y1, x2, y2, x3, y3, TFT_GREY);
      }
    }
    // Convert value to a string
    char buf[10];
    byte len = 4; if (value > 999) len = 6;
    dtostrf(value, len, 1, buf);
    buf[len] = ' '; buf[len+1] = 0; // Add blanking space and terminator, helps to centre text too!
    // Set the text colour to default
    tft.setTextSize(1);

    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    // Uncomment next line to set the text colour to the last segment value!
    tft.setTextColor(colour, TFT_BLACK);
    tft.setTextDatum(MC_DATUM);
    // Print value, if the meter is large then use big font 8, othewise use 4
    if (r > 84) {
      tft.setTextPadding(55*4); // Allow for 4 digits each 55 pixels wide
      tft.drawString(buf, x, y, 8); // Value in middle
    }
    else {
      tft.setTextPadding(4 * 14); // Allow for 4 digits each 14 pixels wide
      tft.drawString(buf, x, y, 4); // Value in middle
    }
    tft.setTextSize(1);
    tft.setTextPadding(0);
    // Print units, if the meter is large then use big font 4, othewise use 2
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    if (r > 84) tft.drawString(units, x, y + 60, 4); // Units display
    else tft.drawString(units, x, y + 15, 2); // Units display

    // Calculate and return right hand side x coordinate
    return x + r;
  }

  void updateTFT() {
    tft.setTextSize(1);
    tft.setTextPadding(82);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setTextDatum(TL_DATUM);

