octal-ip/ESP8266_JBD_BMS_Monitor/src/main.cpp
    if (current != lastCurrent || voltage != lastVoltage) {
      dtostrf(abs(current * voltage), 1, 0, StatString);
      sprintf(post, "%sW", StatString);
      tft.drawString(post, 245, 170, 2);
    }

    if (current != lastCurrent) {
      ringMeter(abs(current), 0, 60, 4, 5, 76, "Amps", GREEN2RED); // Draw ring meter
      tft.setTextDatum(TL_DATUM);
      tft.setTextSize(1);
      tft.setTextPadding(82);
      tft.setTextColor(TFT_WHITE, TFT_BLACK);
      if (current > 0) {
        tft.drawString("Charging", 97, 170, 2);
      }
      else if (current < 0) {
        tft.drawString("Discharging", 97, 170, 2);
      }
      else if (current == 0) {
        tft.drawString("Standby", 97, 170, 2);
      }
      lastCurrent = current;
    }
    
    if (voltage != lastVoltage) {
      ringMeter(voltage, 40, 60, 167, 5, 76, "Volts", BLUE2RED); // Draw ring meter
      lastVoltage = voltage;
    }

    tft.setTextSize(1);
    tft.setTextPadding(82);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setTextDatum(TL_DATUM);

    if (highestCell != lastHighestCell) {
      //tft.drawFloat(highestCell, 3, 97, 185, 2);
      dtostrf(highestCell, 1, 3, StatString);
      sprintf(post, "%sv", StatString);
      tft.drawString(post, 97, 185, 2);
      lastHighestCell = highestCell;
    }

    if (lowestCell != lastLowestCell) {
      dtostrf(lowestCell, 1, 3, StatString);
      sprintf(post, "%sv", StatString);
      tft.drawString(post, 97, 200, 2);
      lastLowestCell = lowestCell;
    }

    if (cellVoltageDelta != lastCellVoltageDelta) {
      dtostrf(cellVoltageDelta, 1, 3, StatString);
      sprintf(post, "%sv", StatString);
      tft.drawString(post, 97, 215, 2);
      lastCellVoltageDelta = cellVoltageDelta;
    }

    if (temps[1] != lastTemp1) {
      dtostrf(temps[1], 1, 1, StatString);
      sprintf(post, "%sc", StatString);
      tft.drawString(post, 245, 185, 2);
      lastTemp1 = temps[1];
    }
    
    if (temps[2] != lastTemp2) {
      dtostrf(temps[2], 1, 1, StatString);
      sprintf(post, "%sc", StatString);
      tft.drawString(post, 245, 200, 2);
      lastTemp2 = temps[2];
    }

    if (percentRem != lastPercentRem) {
      dtostrf(percentRem, 1, 0, StatString);
      sprintf(post, "%s%%", StatString);
      tft.drawString(post, 245, 215, 2);
      lastPercentRem = percentRem;
    }
  }
#endif

void postData (const char *postData) {
  ArduinoOTA.handle();
  TelnetPrint.print("Posting to InfluxDB: "); TelnetPrint.println(postData);

  #ifdef UDP_MODE
    udp.beginPacket(influxhost, influxport);
    udp.printf(postData);
    udp.endPacket();
    delay(5); //This is required to allow the UDP transmission to complete
  #endif

  #ifdef HTTP_MODE
    WiFiClient client;
    HTTPClient http;
    http.begin(client, SECRET_INFLUXDB);
    http.addHeader("Content-Type", "text/plain");
    
    int httpResponseCode = http.POST(postData);
    //httpResponseCode = 200;
    yield(); //For some reason this delay is critical to the stability of the ESP.


    if (httpResponseCode >= 200 && httpResponseCode < 300){ //If the HTTP post was successful
      String response = http.getString(); //Get the response to the request
      //Serial.print("HTTP POST Response Body: "); Serial.println(response);
      TelnetPrint.print("HTTP POST Response Code: "); TelnetPrint.println(httpResponseCode);

      if (failures >= 1) {
        failures--; //Decrement the failure counter.
      }
    }

    else {
      TelnetPrint.print("Error sending HTTP POST: "); TelnetPrint.println(httpResponseCode);
      if (httpResponseCode <= 0) {
        failures++; //Incriment the failure counter if the server couldn't be reached.
      }
    }
    http.end();
    client.stop();
  #endif
}


void processPacket() //This function deciphers the BMS data.
{
  int checkSumCalc = 0x0;
  int checkSumData = 0x1;
  
  for (int i = 2; i < (packetCount-3); i++) //Add all the data together, skipping the header and command code at the start (first 2 bytes), and the checksum and footer at the end (last 3 bytes).
  {
      //Serial.printf("%x ", packetbuff[i]);
      checkSumCalc += packetbuff[i];
  }
  
  checkSumCalc = 65536 - checkSumCalc;
  checkSumData = (packetbuff[packetCount-3] << 8 | packetbuff[packetCount-2]); //OR the checksum bytes provided in the data packet together to find the total.
  
  
  if (checkSumCalc == checkSumData) {
    //TelnetPrint.print("Checksum "); TelnetPrint.print(checkSumCalc);  TelnetPrint.println(F(" matches. "));
    //Second byte: 0x3 is BMS status information. 0x4 is battery voltages.
    if (packetbuff[1] == 0x3) {
      voltage = (packetbuff[4] << 8 | packetbuff[5])/100.0;
      TelnetPrint.printf("Pack voltage: %0.3fv \r\n", voltage);
      if (systemCycles >= avSamples) { //If we have enough samples added to the running average, send the data to InfluxDB.
        dtostrf(voltage, 1, 2, StatString);
        sprintf(post, "Voltage,sensor=bms value=%s", StatString);
        postData(post);
      }

      current = 0.0;
      int current2s = packetbuff[7] | (packetbuff[6] << 8); //Combine both values.
      if (current2s >> 15 == 1) { //Find the most significant bit to determine if the number is negative (2's complement).
        current = (0 - (0x10000 - current2s))/100.0; //Calculate the negative number (2's complement).
      }
      else { //Otherwise calculate the positive number.
        current = current2s/100.0;
      }
      currentAv.addValue(current);
      TelnetPrint.printf("Current: %0.2f \r\n", current);
      if (systemCycles >= avSamples) { //If we have enough samples added to the running average, send the data to InfluxDB.
        dtostrf(currentAv.getAverage(), 1, 2, StatString);
        sprintf(post, "Current,sensor=bms value=%s", StatString);
        postData(post);
        currentAv.clear();
      }

      capacityRem = (packetbuff[8] << 8 | packetbuff[9])/100.0;
      TelnetPrint.printf("Remaining capacity: %0.2f \r\n", capacityRem);
      if (systemCycles >= avSamples) { //If we have enough samples added to the running average, send the data to InfluxDB.
        dtostrf(capacityRem, 1, 2, StatString);
        sprintf(post, "Capacity_Remaining,sensor=bms value=%s", StatString);
        postData(post);
      }
      
      capacityTyp = (packetbuff[10] << 8 | packetbuff[11])/100.0;
      TelnetPrint.printf("Typical capacity: %0.2f \r\n", capacityTyp);
      if (systemCycles >= avSamples) { //If we have enough samples added to the running average, send the data to InfluxDB.
        dtostrf(capacityTyp, 1, 2, StatString);
        sprintf(post, "Capacity_Typical,sensor=bms value=%s", StatString);
        postData(post);
      }

      
      cycles = (packetbuff[12] << 8 | packetbuff[13]);
      TelnetPrint.printf("Cycles: %0.2f \r\n", cycles);
      if (systemCycles >= avSamples) { //If we have enough samples added to the running average, send the data to InfluxDB.
        dtostrf(cycles, 1, 2, StatString);
        sprintf(post, "Cycles,sensor=bms value=%s", StatString);
        postData(post);
      }

      protectionStatus = (packetbuff[20] << 8 | packetbuff[21]);
      TelnetPrint.printf("Protection Status: %d \r\n", protectionStatus);
      if (systemCycles >= avSamples) { //If we have enough samples added to the running average, send the data to InfluxDB.
        dtostrf(protectionStatus, 1, 2, StatString);
        sprintf(post, "Protection_Status,sensor=bms value=%s", StatString);
        postData(post);
      }

      percentRem = packetbuff[23];
      TelnetPrint.printf("Percent Remaining: %d%% \r\n", percentRem);
      if (systemCycles >= avSamples) { //If we have enough samples added to the running average, send the data to InfluxDB.
        dtostrf(percentRem, 1, 2, StatString);
        sprintf(post, "Percent_Remaining,sensor=bms value=%s", StatString);
        postData(post);
      }
      
      cells = packetbuff[25];
      TelnetPrint.printf("Cells: %d \r\n", cells);
      if (systemCycles >= avSamples) { //If we have enough samples added to the running average, send the data to InfluxDB.
        dtostrf(cells, 1, 0, StatString);
        sprintf(post, "Cells,sensor=bms value=%s", StatString);
        postData(post);
        systemCycles = 0;
      }

      NTCs = packetbuff[26];
      TelnetPrint.printf("NTCs: %d \r\n", NTCs);
      if (systemCycles >= avSamples) { //If we have enough samples added to the running average, send the data to InfluxDB.
        dtostrf(NTCs, 1, 2, StatString);
        sprintf(post, "NTCs,sensor=bms value=%s", StatString);
        postData(post);
      }
      
