octal-ip/ESP8266_JBD_BMS_Monitor/src/main.cpp
      for (int i = 0; i < NTCs; i++) {
          temps[i] = ((packetbuff[(2*i)+27] << 8 | packetbuff[(2*i)+28]) * 0.1) - 273.1;
          TelnetPrint.printf("NTC %d temp: %0.1fc \r\n", i, temps[i]);
          if (systemCycles >= avSamples) { //If we have enough samples added to the running average, send the data to InfluxDB.
            dtostrf(temps[i], 1, 2, StatString);
            sprintf(post, "NTC_%d,sensor=bms value=%s", i, StatString);
            postData(post);
          }
      }

      TelnetPrint.println(); TelnetPrint.println();
      systemCycles++;
    }

    else if (packetbuff[1] == 0x4) {
      cellCount = (packetCount - 7)/2; // The number of cells is the size of the array in 16 bit pairs, minus header, footer and checksum.
      TelnetPrint.printf("Calculated cell count: %d \r\n", cellCount);
      float cellVoltages[cellCount];
      lowestCell = 10.0;
      highestCell = 0.0;
      for (int i = 0; i < cellCount; i++) {
        cellVoltages[i] = (packetbuff[(2*i)+4] << 8 | packetbuff[(2*i)+5])/1000.0;
        
        if (cellVoltages[i] < lowestCell) {
          lowestCell = cellVoltages[i];
        }
        if (cellVoltages[i] > highestCell) {
          highestCell = cellVoltages[i];
        }

        TelnetPrint.printf("Cell %d: %0.3fv \r\n", (i+1), cellVoltages[i]);

        if (battCycles >= avSamples) { //If we have enough samples added to the running average, send the data to InfluxDB.
          dtostrf(cellVoltages[i], 1, 3, StatString);
          sprintf(post, "Cell_%d_Voltage,sensor=bms value=%s", (i+1), StatString);
          postData(post);
        }
      }

      cellVoltageDelta = highestCell - lowestCell;
      if (battCycles >= avSamples) { //If we have enough samples added to the running average, send the data to InfluxDB.  
        dtostrf(cellVoltageDelta, 1, 3, StatString);
        sprintf(post, "Cell_Voltage_Delta,sensor=bms value=%s", StatString);
        postData(post);
        battCycles = 0;
      }

      TelnetPrint.println(); TelnetPrint.println();
      battCycles++;
    }

    else {
      for (int i = 0; i < BMSRequestsNum; i++) {
        if (packetbuff[1] == BMSRequests[i].request[2]) { //Check if the packet buffer contains an identifier in our lists of BMS requests.
          BMSRequests[i].value = (packetbuff[4] << 8 | packetbuff[5]);
          if (i ==2 || i == 3 || i == 4 || i == 5) { //Kelvin values for temperature must be converted to celsius.
            BMSRequests[i].value = (BMSRequests[i].value/10) - 273.15;
          }
          TelnetPrint.printf("%s: %ld\r\n", BMSRequests[i].name, BMSRequests[i].value);
          break;
        }
      }
    } 
  }
  else {
      TelnetPrint.printf("Checksum doesn't match. Calulated %d, received %d. \r\n", checkSumCalc, checkSumData);
  }
}

void receiveData() {
  if (JBDSoftSerial.available()) {
    incomingByte = JBDSoftSerial.read();
	
	//Receiving data requires a state machine to track the start of packet, packet type, reception in progress and reception completed.
    // packetStatus = 0 means we're waiting for the start of a packet to arrive.
    // packetStatus = 1 means that we've found what looks like a packet header, but need to confirm with the next byte.
    // packetStatus = 2 means we've received a data packet containing system parameters (e.g. high temperature cut-off)
    // packetStatus = 3 means we've received a system status packet
    // packetStatus = 4 means we've received a battery status packet.

    //TelnetPrint.printf("Received: %X \r \n", incomingByte);
    if (incomingByte == 0xdd && packetStatus == 0) {
      //TelnetPrint.println(F("0xdd found"));
      packetbuff[0] = incomingByte;
      packetCount++;
      packetStatus = 1; //Possible start of packet found.
    }
    else if (packetStatus == 1) {
      if (incomingByte >= 0x03 && incomingByte <= 0x29) {
        //TelnetPrint.printf("Start of packet found: %X \r \n", incomingByte);
        if (incomingByte == 0x03) {
          packetStatus = 3; //Start of system status packet confirmed.
        }
        else if (incomingByte == 0x04) {
          packetStatus = 4; //Start of battery status packet confirmed.
		}
        else {
          packetStatus = 2; //Start of parameter packet confirmed.
        }
        packetbuff[packetCount] = incomingByte;
        packetCount++;
      }
      else {
        JBDSoftSerial.flush();
        packetStatus = 0;
        packetCount = 0;
        //TelnetPrint.println(F("Not a status or parameter packet, ignoring."));
      }
    }
    else if ((packetStatus == 2 && packetCount > 8) || (packetStatus == 3 && packetCount > 42) || (packetStatus == 4 && packetCount > (2 * cells + 6))) { //If more than the expected number of bytes have been received, we must have missed the last byte of the packet. Restart.
      JBDSoftSerial.flush();
      packetStatus = 0;
      packetCount = 0;
      TelnetPrint.println(F("Too many bytes received - resetting."));
    }
    else if ((incomingByte == 0x77 && packetStatus == 2 && packetCount == 8) || (incomingByte == 0x77 && packetStatus == 3 && packetCount == 42) || (incomingByte == 0x77 && packetStatus == 4 && packetCount == (2 * cells + 6))) { //End of packet found. The expected packet length must be accurately calculated as voltage can include the packet footer 0x77, e.g. is 3447 which is 0x0d 0x77
      //TelnetPrint.printf("End of packet found: %X \r \n", incomingByte);
      packetbuff[packetCount] = incomingByte;
      packetCount++;
      processPacket();
      packetCount = 0;
      packetStatus = 0;
      JBDSoftSerial.flush();
    }
    else if (packetStatus == 2 || packetStatus == 3 || packetStatus == 4) {
      packetbuff[packetCount] = incomingByte;
      packetCount++;
    }
  }
}

void sendRequest() {
  if ((unsigned long)(millis() - lastRequest) >= 500) { // Don't send commands to the BMS too quickly.
    if ((unsigned long)(millis() - BMSRequests[statSwitch].LastRequest) >= BMSRequests[statSwitch].RequestFrequency && packetStatus == 0) { //Only request each stat as often as we need, and don't request when a receive is already underway.
      for (int j = 0; j < 7; j++) {
        //TelnetPrint.printf("0x%X ", BMSRequests[statSwitch].request[j]);
        JBDSoftSerial.write(BMSRequests[statSwitch].request[j]);
      }
      TelnetPrint.println();
      BMSRequests[statSwitch].LastRequest = millis();
      lastRequest = millis();
    }
    if (statSwitch < BMSRequestsNum - 1) {
      statSwitch++;
    }
    else {
      statSwitch = 0;
    }
  }
}


void loop() {
  ArduinoOTA.handle();

