octal-ip/ESP8266_JBD_BMS_Monitor/src/main.cpp
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("WiFi disconnected. Attempting to reconnect... ");
    failures++;
    WiFi.disconnect();
    WiFi.begin(SECRET_SSID, SECRET_PASS);
    connectTime = millis();
    while (!WiFi.isConnected() && (unsigned long)(millis() - connectTime) < 5000) { //Wait for the wifi to connect for up to 5 seconds.
      delay(100);
      Serial.print(".");
    }
  }
    
  if (failures >= 40) {  //Reboot the ESP if there's been too many problems retrieving or sending the data.
    Serial.print("Too many failures, rebooting...");
    TelnetPrint.print("Failure counter has reached: "); TelnetPrint.print(failures); TelnetPrint.println(F(". Rebooting..."));
    ESP.restart();
  }

  if ((unsigned long)(millis() - lastUnlock) >= 20000) { //This command must be sent regularly to allow querying of parameters.
    JBDSoftSerial.write(0xdd); JBDSoftSerial.write(0x5a); JBDSoftSerial.write(0x0); JBDSoftSerial.write(0x02); JBDSoftSerial.write(0x56); JBDSoftSerial.write(0x78); JBDSoftSerial.write(0xff); JBDSoftSerial.write(0x30); JBDSoftSerial.write(0x77);
    lastUnlock = millis();

    if (highestCell >= 3.4){ //Turn the external balancer ON if the highest cell voltage is above x
      digitalWrite(BALANCER, 1);
    }
    else if (highestCell < 3.35){ //Turn the external balancer OFF if the highest cell voltage is above
      digitalWrite(BALANCER, 0);
    }
  }

  sendRequest();
  receiveData();
  delay(1); //For some reason this is critical to the stability of the ESP
  #ifdef TFT_ENABLE
    updateTFT();
  #endif
}
